Конфигурация/InformationRegisters/РеквизитыФизическихЛицАнкетные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыФизическихЛицАнкетные</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСмерти</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидУдостоверенияЛичности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерияУдостоверенияЛичности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерУдостоверенияЛичности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачиУдостоверенияЛичности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияДействияУдостоверенияЛичности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганВыдавшийУдостоверениеЛичности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОрганаВыдавшегоУдостоверениеЛичности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезидентРФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВтороеГражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СНИЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОГРНИП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачиОГРНИП</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганВыдавшийОГРНИП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресРегистрации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресРегистрацииФИАС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресМестаЖительства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресМестаЖительстваФИАС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдресФИАС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>EMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефоны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезидентПо173ФЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонДляОповещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВебСтраница</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/РеквизитыФизическихЛицАнкетные/Ext/RecordSetModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРЕДОПРЕДЕЛЕННЫЕ

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если Запись.ВидУдостоверенияЛичности = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ Тогда
			Если НЕ СтрДлина(Запись.СерияУдостоверенияЛичности) = 4
			 ИЛИ НЕ РаботаСоСтрокамиКлиентСервер.ТолькоЦифрыВСтроке(Запись.СерияУдостоверенияЛичности) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле 'Серия удостоверения личности' не соответствует формату: серия паспорта РФ - 4 цифры без других символов", Запись, "СерияУдостоверенияЛичности", "Объект", Отказ);
			КонецЕсли;
			
			Если НЕ СтрДлина(Запись.НомерУдостоверенияЛичности) = 6 
			 ИЛИ НЕ РаботаСоСтрокамиКлиентСервер.ТолькоЦифрыВСтроке(Запись.НомерУдостоверенияЛичности) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле 'Номер удостоверения личности' не соответствует формату: номер паспорта РФ - 6 цифр без других символов", Запись, "НомерУдостоверенияЛичности", "Объект", Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)     
	
	РеквизитыАдреса = Новый Массив;   
	РеквизитыАдреса.Добавить("АдресРегистрации");
	РеквизитыАдреса.Добавить("АдресМестаЖительства");
	РеквизитыАдреса.Добавить("ПочтовыйАдрес");
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Для Каждого Ресурс Из Метаданные().Ресурсы Цикл
			Если Ресурс.Тип.СодержитТип(Тип("Дата")) И Ресурс.Имя <> "ДатаОкончанияДействияУдостоверенияЛичности" Тогда
				Если Запись[Ресурс.Имя] > НачалоДня(Запись.Период) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Ресурс.Представление() + " не может быть позже даты анкеты", Запись.Регистратор,, "Объект." + Ресурс.Имя, Отказ);	
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;  
		//проверяем адреса   
		Для Каждого Элемент из РеквизитыАдреса Цикл   
			Если ПустаяСтрока(Запись[Элемент]) И НЕ ПустаяСтрока(Запись[Элемент + "ФИАС"]) Тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'" + Элемент +  "'" + " не заполнен, но реквизит '" + Элемент+ "ФИАС' не пустой", Запись.Регистратор,, "Объект." + Элемент, Отказ);			
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;
	
	УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);

КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если Не ЭтотОбъект.ДополнительныеСвойства.УдалениеВСоставеИзмененияНабора И ЭтотОбъект.Количество() > 0 Тогда
		
		// Проверим корректность сведений о дате смерти:
		// 1. если заполнена дата смерти, то и во всех последующих анкетах она не должна быть пустой;
		// 2. дата смерти не может меняться.
		
		#Область Текст_запроса
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	НаборЗаписей.Организация КАК Организация,
			|	НаборЗаписей.ЮрФизЛицо КАК ЮрФизЛицо,
			|	НаборЗаписей.Язык КАК Язык
			|ПОМЕСТИТЬ _ПроверяемыеИзмерения
			|ИЗ
			|	&НаборЗаписей КАК НаборЗаписей
			|ГДЕ
			|	НаборЗаписей.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РеквизитыФизическихЛицАнкетные.Организация КАК Организация,
			|	РеквизитыФизическихЛицАнкетные.ЮрФизЛицо КАК ЮрФизЛицо,
			|	РеквизитыФизическихЛицАнкетные.Язык КАК Язык,
			|	""после анкеты с заполненной датой смерти не должно быть анкет, где она не заполнена"" КАК ТекстОшибки
			|ИЗ
			|	РегистрСведений.РеквизитыФизическихЛицАнкетные КАК РеквизитыФизическихЛицАнкетные
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ПроверяемыеИзмерения КАК _ПроверяемыеИзмерения
			|		ПО (_ПроверяемыеИзмерения.Организация = РеквизитыФизическихЛицАнкетные.Организация)
			|			И (_ПроверяемыеИзмерения.ЮрФизЛицо = РеквизитыФизическихЛицАнкетные.ЮрФизЛицо)
			|			И (_ПроверяемыеИзмерения.Язык = РеквизитыФизическихЛицАнкетные.Язык)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные КАК РеквизитыФизическихЛицАнкетныеПосле
			|		ПО (РеквизитыФизическихЛицАнкетныеПосле.Организация = РеквизитыФизическихЛицАнкетные.Организация)
			|			И (РеквизитыФизическихЛицАнкетныеПосле.ЮрФизЛицо = РеквизитыФизическихЛицАнкетные.ЮрФизЛицо)
			|			И (РеквизитыФизическихЛицАнкетныеПосле.Язык = РеквизитыФизическихЛицАнкетные.Язык)
			|			И (РеквизитыФизическихЛицАнкетныеПосле.Период > РеквизитыФизическихЛицАнкетные.Период)
			|			И (РеквизитыФизическихЛицАнкетныеПосле.ДатаСмерти = ДАТАВРЕМЯ(1, 1, 1))
			|ГДЕ
			|	РеквизитыФизическихЛицАнкетные.ДатаСмерти <> ДАТАВРЕМЯ(1, 1, 1)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	РеквизитыФизическихЛицАнкетные.Организация,
			|	РеквизитыФизическихЛицАнкетные.ЮрФизЛицо,
			|	РеквизитыФизическихЛицАнкетные.Язык,
			|	""дата смерти не может меняться""
			|ИЗ
			|	РегистрСведений.РеквизитыФизическихЛицАнкетные КАК РеквизитыФизическихЛицАнкетные
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ПроверяемыеИзмерения КАК _ПроверяемыеИзмерения
			|		ПО (_ПроверяемыеИзмерения.Организация = РеквизитыФизическихЛицАнкетные.Организация)
			|			И (_ПроверяемыеИзмерения.ЮрФизЛицо = РеквизитыФизическихЛицАнкетные.ЮрФизЛицо)
			|			И (_ПроверяемыеИзмерения.Язык = РеквизитыФизическихЛицАнкетные.Язык)
			|ГДЕ
			|	РеквизитыФизическихЛицАнкетные.ДатаСмерти <> ДАТАВРЕМЯ(1, 1, 1)
			|
			|СГРУППИРОВАТЬ ПО
			|	РеквизитыФизическихЛицАнкетные.Организация,
			|	РеквизитыФизическихЛицАнкетные.ЮрФизЛицо,
			|	РеквизитыФизическихЛицАнкетные.Язык
			|
			|ИМЕЮЩИЕ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РеквизитыФизическихЛицАнкетные.ДатаСмерти) > 1");
		
		#КонецОбласти
		
		Запрос.УстановитьПараметр("НаборЗаписей", ЭтотОбъект.Выгрузить(Неопределено, "Организация, ЮрФизЛицо, Язык"));
		
		ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаЗапроса.Следующий() Цикл
			
			ТекстОшибки = СтрШаблон("Ошибка записи анкетных данных %1 (%2, %3): %4",
				ВыборкаЗапроса.ЮрФизЛицо, ВыборкаЗапроса.Организация, ВыборкаЗапроса.Язык, ВыборкаЗапроса.ТекстОшибки);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , , , Отказ);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
